сделать вкладку с квадратом который будет при нажатии стрелок прижиматься к указаному направлением стрелки краю вкладки.

признать что книжная система требует переделки. все вкладки должны быть одного типа.

внутри каждой вкладки должно быть несколько слоёв.

сделать вкладку внутри которой будет несколько слоёв квадратиков.



расположение квадратиков можно задовать как всяки костылями приделываемыми к каждому квадратику так и программой внешней которая будет размещать все квадратики.

ещё можно как-то смешать оба способа.

сделать вкладку на кторой будет прямая у крожочик который будет от неё отталкиваться и который будет перемещаться от нажатия стрелок на клавиатуре.

сделать вкладку которая будет при нажатии спейса разворачивать родительскую книгу на всё вкладку в которой она находиться.

это поможет развернуть всё на весь экран.


сделать вкладку на которой редактор текста.

сделать так, чтобы можно было набирать русский текст.

сделать вкладку на которой будет рисоваться сетка. ещё на ней надо сделать возможность перемещения камеры и изменение масштаба.