Сделать сохранения и загрузку replay`я в файл.
Сделать подсветку для юнитов лидеров команд по фрагам.
Сделать подсветку для юнитов лидеров команд по hp.
Сделать подсветку n-юнитам лучшим по кол-ву hp.
Сделать выделение юнитов во время реплея.
Сделать подсказку с информаций по юниту:
{
  HP,Frags,Hits,Shots,Name,Target,Interval,DamageDealt,Damage
}
Сделать скролбар для выбора кадра из реплея.
Сделать чтобы можно было при зажатии стрелок на клаве управлять номером кадра.
Сделать отсановку проигрования при нажатии пробела ил паузы.
Сделать умную подсветку которая взаимодействует с другими ботами.

Исправить формулу подсчёта стоимости виртуального мира.