сделать чтобы игрок прыгал.


предложение
{
  можно сделать чтобы передний план содержал настоящий физический объект.
  он будет летать и прыгать корректно с точки зрения физики.
  а на заднем плане будет клеточный автомат.
  он будет обновляться тоже каждый кадр.
  теперь надо связать передний и задний план.
  например можно отправлять изменения в клеточный автомат когда ГГ перемещаеться из одной клетки в другую.
  тоесть пока гг двигаеться внутри клетки мы клеточному автомату ничего не говорим.
  как только гг пересёк границу клетки мы изменяем клеточный автомат так, чтобы он в клеточном мире тоже подвинулся.
  а зачем он вообще нужен в клеточном мире?
  чтобы клеточный мир с ним взаимодействовал?
}



как я могу это сделать и зачем мне это надо?
прыжки нужны для того, чтобы игрок мог перемещаться по уровню вверх.
задача игрока найти выход и собрать все ништяки на уровне.

если игрок будет собирать ништяки за время, то тогда он сможет сравнить свою игру с другими игроками.

короче моя задача сделать так, чтобы игрок видел как получить больше очков.
тоесть у игрока в каждый момемнт времени есть выбор получить больше очков сейчас или подождать и
набрать больше очков потом.
вообще можно сделать ещё интереснее.
можно расположить на карте разные бонусы.
одни бонусы будут просто сразу давать кучу очков, а другие будут постепенно довать очки.
ещё можно на карте разместить потребители очков.
тоесть игрок сможет потратить очки на что-то.
например он может потратить очки и купить рокетджамп.
или например он может тупо потратить очки и сразу открыть дверь на следующий уровень.
или он может открыть двери подешевле, а затем взять вещь находящуюся за ней.
например он может открыть дверь, взять рокет и пойти разрушить другую дверь рокетом.
тоесть сразуже пройти уровень.

или например можно сделать на уровне цель - убить босса.
игрок может убить боса, а может просто взять и пройти на следующий уровень.


короче в игре есть куча всяких разных показателей.
время за которое пройден уровень.
кол-во собраных на уровне очков.
кол-во не потраченых на уровне очков.
кол-во потраченых очков.
кол-во убитых монстров.
короче можно для каждого игрока найти свой показатель по которому он лучше чем другие.
игрок может сделать свой не офицальный топ-100 игроков по какому-то запросу.
короче можно рассказывать каждому игроку о том, что он лучше чем другие вот по такому запросу.
но есть такой запрос, который будет признан большим кол-вом игроков.
тоесть все игроки будут мерять себя именно по этому запросу.

тоесть каждый игрок следит за результатом не одного запроса, а за целой пачкой запросов.
ААА круть! Это именно то что мне нравиться.

