



сделать флаг without_tex. //готово.
сделать чтобы при поднятом флаге without_tex текстуры не рисовались. //готово.
сделать чтобы при включеном draw_back содержимое не вылезало за границы страницы. //готово.
сделать лестницы.  // готово.
сделать перемещение гг по лестнице вверх и вниз. //готово.


сделать клетку типа старт. //готово.
сделать клетку типа финишь. //готово.
сделать вызов кода {info="win";} при достиженни игроком финиша. //готово.

сделать счётчик очков здоровья у игрока. // готово.
сделать вызов кода {info="game over";} при отрицательном здоровья у гг. // готово.
сделать счётчик игровых очков у игрока. // готово.
сделать клетки наносящие урон игроку. // готово.
сделать клетки увеличивающие игровые очки у игрока когда он встаёт на них. // готово.
сделать вывод на экран игровых очков. // готово.

сделать симуляцию игровой механики в 4-раз медленее. // готово.
сделать ещё один вид лавы по которой игрок может карабкаться.
сделать клетки добаляющие hp игроку. // готово.



сделать блоки которые игрок может двигать.
сделать вывод текста "you win!" над клеткой выхода после её прохождения.