отключить сетевую часть вообще. //готово.
сделать новую вкалдку. //готово.
сделать харнение карты в vector<QapColor>. //готово.
сделать отрисовку карты. //готово.
сделать камеру. //готово.
сделать ГГ как struct{vec2i pos;vec2i v;}  //готово.
сделать отрисовку ГГ. //готово.
сделать управление ГГ со стрелок. //готово.
сделать привязку камеры к ГГ по нажатию 'T'. //готово.
сделать загрузку карты из png-хи. //готово.
сделать прокрутку карты. //готово.
сделать загрузку координат ГГ из png-хи. //готово.
сделать перемещение камеры стрелками когда нажат VK_CONTROL. //готово.
сделать рестарт при нажатии кнопки 'R'; //готово.
редактирование карты прямо внутри игры
{
  сделать загрузку карты при нажатии кнопки 'U'; //готово.
  сделать буфер с цветом для редактора. //готово.
  сделать выделение ячейки находящейся под курсором. //готово.
  сделать включение/выключение редактора при нажатии 'E'. //готово.
  сделать копирование цвета из выделенной ячейки в буфер при нажатии 'C'. //готово.
  сделать вставку цвета из буфера в выделенную ячейку при нажатии 'V'. //готово.
  сделать сохранение карты обратно в png при нажатии 'S'. //готово.
  ---
  
}