игра с форумом в котором каждый пользователь может запускать свои программы на серверном железе.
--------------------------------------------------------------------------------------------------
создал тему.
кто-то в ней отписываеться.
ты создал программу на сервере которая отправит http-запрос если заметит что кто-то отписался в твоей теме.

современные форумы позволяют присылать писма уведомления если кто-то написал в твоей теме.

но это уныло говно. может пользователь не нравиться использовать почтовый протокол?
но ок. засчитываем современным форумам галочку за то, что позволяют хоть как-то решать эту проблемму.


ещё пример.
ты созал тему.
кто-то в ней написал.
ты создал программу которая удалит любое сообщение созданое в твоей теме.
твоя программа заметила сообщение и удалила его.
ты доволен.


ещё.
ты создал тему.
ты создал программу которая будет собирать содержимое ответов, а затем обрабатывать и помещать результат в заглавный пост.
всё! теперь мне больше не надо делать голосовалки как отдельную сущность. каждый юзер может сам сделать голосовалку какую пожелает.
ты доволен.

нет ни одного сайта который предоставлял бы пользователям такую фишку как в примере с автоматической обработкой ответов.
сейчас тебе скорее всего придёться заходить на сайт и прасить ответы. а это сложно.

ты создал аккаунт.
ты создал программу для аккаунта которая производт какую-то обработку информации на форуме и хранит результат в памяти.
затем ты отправляешь запрос на сайт и читаешь эту память.

таким образом ты можешь стянуть одной пачкой вообще всё с форума одним махом.