сделать столкновение юнитов со стенками.
сделать систему частиц.
сделать гравитацию.
сделать детектор пропущеных кадров.

сделать цели по которым можно будет стрелять.

блин я точно уверен, что если я сделаю столкновение пуль со юнитами, то тогда можно будет потестировать.

сейчас смысла тестировать нет. т.к нет пули в юнитов не попадают.
да можно двигать.
да можно стрелять.
да нет энерции у юнитов.
да мир передаёться целиком каждый кадр.
да можно заходить в пещеры.


так... я не хотел делать, чтобы акторы убивали друг друга.
я хотел чтобы акторы вместе уничтожали ботов в игре.
и чтобы с ботов падал лут.



мне надо сделать ботов, которые будут постись где-то на карте.

сделать камеру.
нужно сделать камеру котрая будет следовать за игроком.
просто я собираюсь делать уровни настолько большими, что они не будут убирваться на экране.

мне придёться сделать фармилку мобов.

можно сделать просто препядствие через которое пули будут пролетать насквозь после того, как оно словит одну из пуль.
затем это препядствие появиться снова через какое-то время.

просто сделать сомовостанавливающееся препядствие?

да. тогда можно будет как бы разрушать уровень, но 

