qap
{
  //auto F(x){string X=x.toStr();}=>{core.add(X+x)}
  cpp
  {
  }
  foreach_struct_in(cpp)do{
    auto e=build_toproto
  }
}

auto s=net_load("http://system.zz.mu/out_gd.php");
packerphp

охота сделать чтобы из моего скрипта можно было бы грузить что-то из интернета.
я пока не знаю зачем мне это нужно, но уже охота.
всё понял зачем это нужно.
так я могу соеденить несколько своих программ. вот зачем.

сделать шаблон для посетителя.
сделать пример эталонного посетителя.


