сделать бекап.
подчинить сплайны.
подчинить редактор.
прикрутить интерактивные кнопки.
обновить бекап.


я не достаточно много страдаю от нехватки производительности.
я ещё не загнан в угол.
программа работает медленно.
я не хочу её развивать, т.к она уже тормозит.
я не вижу способа как ускорить программу.

надо загнать себя в тупик.
сделать программу которая будет крутой, но которая будет тормозить.
а потом уже искать выход.

хочу несколько слоёв кнопок.
тоесть я хочу, чтобы кнопки исчезали. надо попробовать.