сделать лексемы для разбора массива.
сделать лексемы для оператора чтения значения элемента из массива.
сделать лексемы для оператора записаи значения в элемент массива.

using foo50=array{foo,50};

a{} e;

{
  
}

{
  array{int,10} arr;
  arr[5]=10;
  auto e=arr[4];
  int u=obj.r[10].arr[x][y].data.u;
}


так сделать объявление переменной типа массив.

что может быть внутри шаблонного параметра?
имя типа.
алиас.
число.
константное выражение. = константый вызов константной функции. чтение констаной переменной? вызов константного оператора. но пока - только число.